In [1]:
import pandas as pd
import sqlite3

In [2]:
try:
    conn = sqlite3.connect("broccolii.db")    
except Exception as e:
    print(e)

In [3]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(f"Table Name : {cursor.fetchall()}")

Table Name : [('Word',), ('sqlite_sequence',), ('Category',), ('Account',), ('Card',), ('CardEffect',), ('WordCategory',), ('AccountCard',), ('ExpiredToken',)]

In [5]:
word =  pd.read_sql_query("SELECT * FROM Word", conn)
word.head()

   id     word
0   1   carrot
1   2   potato
2   3     rice
3   4   tomato
4   5  cabbage

In [7]:
sqlite_sequence =  pd.read_sql_query("SELECT * FROM sqlite_sequence", conn)
sqlite_sequence

         name  seq
0     Account    5
1    Category    3
2        Word  998
3        Card   16
4  CardEffect   12

In [8]:
Category =  pd.read_sql_query("SELECT * FROM Category", conn)
Category

   id         name
0   1  Agriculture
1   2        Green
2   3      B_words

In [9]:
Account =  pd.read_sql_query("SELECT * FROM Account", conn)
Account

,id,broccolis,username,password
0,1,0,Alettuce,$2b$12$pkyrX.mR3hIr6dmB5825W.eHZALrUA.ntJAbtER...
1,2,0,Brocolivier,$2b$12$k3HQy2Fe7a4JBZQVOseP7Ouot8jqDTcdBjLfNW/...
2,3,0,Picorims,$2b$12$Y9UT8yD83z1T0/eq6v9RQ.K1dcjJVAzkQga7lJI...
3,4,0,Ar-No,$2b$12$tb0yAk5c3rKBI9nuxpZ.eOrpQVoZ4il4tdbnUXh...
4,5,0,Maximator,$2b$12$3tiTxYfWB/mZXiSAh87WO.SVqpE3KHJcX.3r1A1...

In [10]:
Card =  pd.read_sql_query("SELECT * FROM Card", conn)
Card

,id,name,effect,rarity,isNegative,idCardEffect,adding,multiplyBy
0,1,Farmer,Will add 1 broccoli to your account every seco...,common,0,NaN,1.0,1.0
1,2,Farmer,Will add 1 broccoli to your account every seco...,common,1,NaN,1.0,1.0
2,3,Super soil,Will multiply your broccoli production by 2 !,rare,0,NaN,0.0,2.0
3,4,Super soil,Will multiply your broccoli production by 2 !,rare,1,NaN,0.0,2.0
4,5,Farmer,Will add 1 broccoli to your account every seco...,Common,0,1.0,NaN,NaN
5,6,Farmer,Will add 1 broccoli to your account every seco...,Common,1,1.0,NaN,NaN
6,7,Super soil,Will multiply your broccoli production by 2 !,Rare,0,7.0,NaN,NaN
7,8,Super soil,Will multiply your broccoli production by 2 !,Rare,1,7.0,NaN,NaN
8,9,Eggplant,Will multiply your click effects by 2 !,Rare,0,5.0,NaN,NaN
9,10,Eggplant,Will multiply your click effects by 2 !,Rare,1,5.0,NaN,NaN
10,11,Carrot,Your clicks will now give 5 more broccolis !,Legendary,0,4.0,NaN,NaN
11,12,Carrot,Your clicks will now give 5 more broccolis !,Legendary,1,4.0,NaN,NaN
12,13,Beet,Gives you 10% more chance to Critical Click !,Rare,0,9.0,NaN,NaN
13,14,Beet,Gives you 10% more chance to Critical Click !,Rare,1,9.0,NaN,NaN
14,15,Butternut,Doubles your Critical Click chances !,Legendary,0,11.0,NaN,NaN
15,16,Butternut,Doubles your Critical Click chances !,Legendary,1,11.0,NaN,NaN

In [11]:
CardEffect =  pd.read_sql_query("SELECT * FROM CardEffect", conn)
CardEffect

    id  idEffect                     name  value
0    1         1        Add To Production   1.00
1    2         1        Add To Production   2.00
2    3         2             Add To Click   1.00
3    4         2             Add To Click   5.00
4    5         3   Multiply Production By   2.00
5    6         3   Multiply Production By   3.00
6    7         4       Multiply Clicks By   2.00
7    8         4       Multiply Clicks By   3.00
8    9         5       Add To Crit Chance   0.10
9   10         5       Add To Crit Chance   0.25
10  11         6  Multiply Crit Chance By   2.00
11  12         6  Multiply Crit Chance By   3.00

In [12]:
WordCategory =  pd.read_sql_query("SELECT * FROM WordCategory", conn)
WordCategory

     idWord  idCategory
0       208           1
1       260           1
2        61           1
3       396           1
4       116           1
..      ...         ...
880     903           3
881     956           3
882     942           3
883     812           3
884     827           3

[885 rows x 2 columns]

In [13]:
AccountCard =  pd.read_sql_query("SELECT * FROM AccountCard", conn)
AccountCard

Empty DataFrame
Columns: [idAccount, idCard, isEquipped]
Index: []

In [11]:
cards = pd.read_sql_query("""SELECT c.id, c.name, effect, rarity, isNegative, ce.name, ce.value
            FROM Card c, CardEffect ce
            WHERE c.idCardEffect = ce.id;""", conn)

In [12]:
cards.to_pickle('cards.pkl')

In [17]:
cards.columns

Index(['id', 'name', 'effect', 'rarity', 'isNegative', 'name', 'value'], dtype='object')

In [18]:
cards.columns = ['id', 'name', 'effect', 'rarity', 'isNegative', 'effectType', 'value']

In [19]:
cards['effectType']

0           Add To Production
1           Add To Production
2          Multiply Clicks By
3          Multiply Clicks By
4      Multiply Production By
5      Multiply Production By
6                Add To Click
7                Add To Click
8          Add To Crit Chance
9          Add To Crit Chance
10    Multiply Crit Chance By
11    Multiply Crit Chance By
Name: effectType, dtype: object

In [21]:
import classes.py

ModuleNotFoundError: No module named 'bcrypt'

In [ ]:
user =